1) selection column- df[col] - Series
2) selection row by label - df.loc[label]- Series
3) selection row by integerr location - df.iloc[loc] - Series
4) slice rows - df[5:10] - DataFrame
5) select rows by boolean vector - df[bool_vec]- DataFrame

In [2]:
import pandas as pd
import numpy as np

In [5]:
d={
    "A":[1,2,3,4],
    "B":[5,6,7,8]
}

df=pd.DataFrame(d)
df

   A  B
0  1  5
1  2  6
2  3  7
3  4  8

In [20]:
df=df.assign(C=df["B"]*2)
df

   A  B   C
0  1  5  10
1  2  6  12
2  3  7  14
3  4  8  16

In [99]:
print(df.loc[0:2, "A":"B"]) # BOTH A AND B ARE INCLUSIVE

   A  B
0  1  5
1  2  6
2  3  7

In [96]:
print(df.loc[[0,1],["A","B"]])

   A  B
0  1  5
1  2  6

In [67]:
print(df.loc[:,'B']) #series
print(df.loc[:,['B']])#dataframe

0    5
1    6
2    7
3    8
Name: B, dtype: int64
   B
0  5
1  6
2  7
3  8

In [97]:
print(df.iloc[0:2, 0:3])

   A  B   C
0  1  5  10
1  2  6  12

In [93]:
print(df.iloc[[0,1],[0,1]]) #dataframe

   A  B
0  1  5
1  2  6

In [75]:
print(df.iloc[:,1]) #series
print(df.iloc[:,[1]]) #dataframe

0    5
1    6
2    7
3    8
Name: B, dtype: int64
   B
0  5
1  6
2  7
3  8

In [86]:
print(df[0:2]["A"]) #series
print(df[0:2][["A"]])# DataFrame

0    1
1    2
Name: A, dtype: int64
   A
0  1
1  2

In [90]:
print(df["A"][0:2]) #series
print(df[["A"]][0:2]) #DataFrame

0    1
1    2
Name: A, dtype: int64
   A
0  1
1  2

#### Data alignment and arithmetic

In [32]:
df1=pd.DataFrame(
    np.random.randn(10,4),
    columns=["A","B","C","D"]
)

df2=pd.DataFrame(
    np.random.randn(7,3),
    columns=["A","B","C"]
)

In [33]:
#when alighment between dataframe automatically align on both columns and the index
df1+df2

          A         B         C   D
0 -2.245901 -1.538855  1.098256 NaN
1  0.947613 -1.497001 -1.551222 NaN
2  1.219505 -0.129417 -0.042582 NaN
3 -0.130880  1.556463 -0.084275 NaN
4 -1.960364  1.917099  1.638055 NaN
5 -1.445775  0.241335  0.222125 NaN
6 -1.077367  1.895183 -0.257633 NaN
7       NaN       NaN       NaN NaN
8       NaN       NaN       NaN NaN
9       NaN       NaN       NaN NaN

In [35]:
df

   A  B   C
0  1  5  10
1  2  6  12
2  3  7  14
3  4  8  16

In [42]:
df-df.iloc[0]

   A  B  C
0  0  0  0
1  1  1  2
2  2  2  4
3  3  3  6

In [44]:
df*5+10

    A   B   C
0  15  35  60
1  20  40  70
2  25  45  80
3  30  50  90

Boolean operators

In [53]:
df1=pd.DataFrame(
    {
        "A":[1,0,1],
        "B":[0,1,1],   
    },
    dtype=bool
)

df1

       A      B
0   True  False
1  False   True
2   True   True

In [51]:
df2=pd.DataFrame(
    {
        "A":[0,1,1], 
        "B":[1,1,0]
    },
    dtype=bool
)

df2

       A      B
0  False   True
1   True   True
2   True  False

In [54]:
#AND
#1*1=1
#1*0=0
#0*1=0
#0*0=0

df1 & df2 #AND

       A      B
0  False  False
1  False   True
2   True  False

In [1]:
#1+1=1
#0+1=1
#1+0=1
#0+0=0

df1 |df2 #OR

NameError: name 'df1' is not defined

In [56]:
#1^1=0
#1^0=1
#0^1=1,
#0^0=0

df1^df2 #XOR

       A      B
0   True   True
1   True  False
2  False   True

In [59]:
-df1  #NOT

       A      B
0  False   True
1   True  False
2  False  False

In [60]:
df1==df2

       A      B
0  False  False
1  False   True
2   True  False

In [61]:
df1!=df2

       A      B
0   True   True
1   True  False
2  False   True

In [118]:
df.T #transposing

    0   1   2   3
A   1   2   3   4
B   5   6   7   8
C  10  12  14  16

#### DataFrame interoperability with NumPy functions